/**
 ******************************************************************************
 * @file		app_http_server.h
 * @author	Vu Quang Bung
 * @date		26 June 2023
 ******************************************************************************
 **/
#ifndef _APP_HTTP_SERVER_H_
#define _APP_HTTP_SERVER_H_
/*-----------------------------------------------------------------------------*/
/* Header inclusions */
/*-----------------------------------------------------------------------------*/
#include "stdint.h"
#include "esp_http_server.h"
#include "esp_log.h"
/*-----------------------------------------------------------------------------*/
/* Constant definitions  */
/*-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------*/
/* Data type definitions */
/*-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------*/
/* Macro definitions  */
/*-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------*/
/* Global variables  */
/*-----------------------------------------------------------------------------*/
typedef void (*http_server_handle_t)(char *data, int len); // dinh nghia func callback
/*-----------------------------------------------------------------------------*/
/* Function prototypes  */
/*-----------------------------------------------------------------------------*/

/**
 *  @brief Hàm gửi tin nhắn đến node cụ thể theo unicast address
 *
 */
void start_webserver(void);

/**
 *  @brief Hàm gửi tin nhắn đến node cụ thể theo unicast address
 *
 */
void stop_webserver(void);

/**
 *  @brief Hàm gửi tin nhắn đến node cụ thể theo unicast address
 *
 */
void http_get_set_callback(void *cb);

/**
 *  @brief Hàm gửi tin nhắn đến node cụ thể theo unicast address
 *
 */
void http_post_set_callback(void *cb);
#endif /* _APP_HTTP_SERVER_H_ */
       /********************************* END OF FILE ********************************/
       /******************************************************************************/